{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "input_length": 100, "output_dim": 128, "dtype": "float32", "name": "embedding_1", "input_dim": 5000, "mask_zero": false, "embeddings_regularizer": null, "embeddings_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 100], "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 256, "activity_regularizer": null, "trainable": true}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_1", "layer": {"class_name": "SimpleRNN", "config": {"return_sequences": true, "dropout": 0.2, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 0, "name": "simple_rnn_1", "go_backwards": false, "bias_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "units": 256, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, "trainable": true}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "trainable": true}}]}